bien/app/controllers/reviews_controller.rb

def index
   # this is our list page for our reviews

   @number = rand(100)

   @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

def create
  # take info from the form and add it to the database
  @review = Review.new(form_params)

  # save this to the database
  if @review.save
---
INSERT INTO "reviews" ("title", "body", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "McDonalds"], ["body", "This place was great!"], ["score", 5], ["created_at", "2022-09-13 02:45:26.957680"], ["updated_at", "2022-09-13 02:45:26.957680"]]

def show
   #individual review page
   @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

def destroy
 # find the individual review
 @review = Review.find(params[:id])


# destroy

@review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]

def edit

   # find the individual review (to edit)
   @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

def update
    # find the individual review
    @review = Review.find(params[:id])

    # update with the new info from the form
    if @review.update(form_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["title", "testfewfew"], ["body", "ttteewfewf"], ["updated_at", "2022-09-13 23:44:21.612079"], ["id", 3]]