bien/app/controllers/reviews_controller.rb

def index
   # this is our list page for our reviews
   @price = params[:price]
   @cuisine = params[:cuisine]
   @location = params[:location]

   # start with all the reviews
   @reviews = Review.all

   # filtering by price
   if @price.present?
     @reviews = @reviews.where(price: @price)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."price" = ?  [["price", 1]]